<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=windows-1252">
	<TITLE>Enlace Espacial</TITLE>
</HEAD>
<BODY LANG="es-ES" DIR="LTR">
<P>
<FONT COLOR="#800000">
<B>Enlace Espacial</B>
</FONT>
</P>
<P>
Este geoproceso, al igual que un join entre tablas, permite
transferir los atributos de una capa a otra en base a una
caracter&iacute;stica com&uacute;n. A diferencia del join de las
bases de datos relacionales, en este caso la caracter&iacute;stica
com&uacute;n no es un que un campo de las dos tablas tome el mismo
valor (la clave del join), sino que los elementos relacionados de las
dos capas cumplan unos criterios espaciales.
</P>
<P>
El geoproceso Enlace Espacial implementado por la extensi&oacute;n
de geoprocesamiento de gvSIG permite seguir dos tipos de criterios
espaciales para establecer el enlace espacial:
</P>
<UL>
	<LI><P><B>Vecino m&aacute;s pr&oacute;ximo (relaci&oacute;n 1-&gt;1)</B>.
	Asigna a un elemento de la capa origen los atributos del elemento
	m&aacute;s pr&oacute;ximo de la capa enlazada. En el caso de que el
	elemento m&aacute;s pr&oacute;ximo intersecte (o est&eacute;
	contenido para el caso de pol&iacute;gonos) al elemento original,
	habiendo por tanto varias intersecciones, el algoritmo tomar&aacute;
	el primer elemento analizado de las posibles intersecciones.</P>
	<LI><P><B>Contenido en (relaci&oacute;n 1-&gt;M).</B> Relaciona un
	elemento de la capa origen con varios elementos de la capa destino
	(en concreto, con aquellos que son intersectados). En este caso la
	capa origen no heredar&aacute; los atributos de la capa relacionada,
	sino que la operativa ser&aacute; muy parecida a la del geoproceso
	Disolver. Para los M elementos relacionados con un elemento de la
	capa origen, se dar&aacute; al usuario la posibilidad de escoger una
	o varias funciones resumen (media, m&iacute;nimo, m&aacute;ximo,
	sumatorio) que se aplicar&aacute;n sobre los atributos num&eacute;ricos
	de la capa enlazada.</P>
</UL>
<P>
<IMG SRC="spatialjoindesc.png" NAME="Imagen1" ALIGN=LEFT BORDER=0>
</P>
<P>
Este Geoproceso puede ser de gran utilidad para la realizaci&oacute;n
de an&aacute;lisis de corredor. Por ejemplo:
</P>
<UL>
	<LI><P>Qu&eacute; zonas urbanos no tienen una parada de autobuses en
	un radio de 500 m.</P>
	<LI><P>Qu&eacute; zonas urbanas carecen de colegios en un radio de
	1000 m.</P>
	<LI><P>Qu&eacute; pozos incumplen la normativa al no respetar la
	distancia m&iacute;nima entre dos consecutivos.</P>
	<LI><P>Etc.</P>
</UL>
</BODY>
</HTML>