<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
	<TITLE>Enlace Espacial</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.0  (Linux)">
	<META NAME="CREATED" CONTENT="20070803;10295600">
	<META NAME="CHANGED" CONTENT="20070803;10320500">
	<STYLE TYPE="text/css">
	<!--
		@page { size: 21cm 29.7cm }
	-->
	</STYLE>
</HEAD>
<BODY LANG="es-ES" DIR="LTR">
<P ALIGN=JUSTIFY STYLE="margin-bottom: 0.49cm"><FONT SIZE=2 STYLE="font-size: 9pt"><B><FONT COLOR="#800000">JUN&Ccedil;&Atilde;O
ESPACIAL / SPATIAL JOIN</FONT></B></FONT></P>
<P ALIGN=JUSTIFY STYLE="margin-bottom: 0.49cm">Este geoprocesso, &eacute;
similar a um <B>Join</B> entre tabelas alfanum&eacute;ricas, permite
transferir os atributos de uma camada para outra com base em uma
caracter&iacute;stica comum. A diferen&ccedil;a entre o “<B>Join
Tradicional</B>” e um <B>Join Espacial</B> &eacute; que as
caracter&iacute;sticas comuns consideradas, n&atilde;o s&atilde;o que
“um” ou “muitos” atributos das tabelas possuam o mesmo valor
(ex: chaves prim&aacute;rias), mas sim as caracter&iacute;sticas
espaciais. 
</P>
<P ALIGN=JUSTIFY>O geoprocesso <B>Jun&ccedil;&atilde;o Espacial</B>
implementado pela extens&atilde;o de geoprocessamento de gvSIG
permite seguir dois tipos de crit&eacute;rios espaciais para
estabelecer a <B>Jun&ccedil;&atilde;o Espacial</B>: 
</P>
<UL>
	<LI><P ALIGN=JUSTIFY STYLE="margin-top: 0.49cm; margin-bottom: 0cm">“<B>Vizinho
	mais pr&oacute;ximo” (rela&ccedil;&atilde;o 1-&gt;1)</B>. Atribui
	a um elemento da camada origem os atributos do elemento mais pr&oacute;ximo
	da camada destino/relacionada. Caso o elemento mais pr&oacute;ximo
	intersecte (ou esteja contido no caso de pol&iacute;gonos) ao
	elemento original, havendo por tanto v&aacute;rias interse&ccedil;&otilde;es,
	o algoritmo tomar&aacute; o primeiro elemento analisado das
	poss&iacute;veis interse&ccedil;&otilde;es. 
	</P>
</UL>
<P ALIGN=JUSTIFY STYLE="margin-left: 1.27cm; margin-top: 0.49cm; margin-bottom: 0cm">
<BR>
</P>
<UL>
	<LI><P ALIGN=JUSTIFY STYLE="margin-bottom: 0.49cm">“<B>Est&aacute;
	contido / Contido em” (rela&ccedil;&atilde;o 1-&gt;M).</B>
	Relaciona um elemento da camada origem com v&aacute;rios elementos
	da camada destino (mais especificamente, com aqueles que s&atilde;o
	intersectados). Neste caso a camada origem n&atilde;o herdar&aacute;
	os atributos da camada relacionada, sendo que a opera&ccedil;&atilde;o<FONT COLOR="#ff0000">
	</FONT>ser&aacute; muito parecida a do geoprocesso <B>Dissolver</B>.
	Para os <B>M</B> elementos relacionados com um elemento da camada de
	origem, se dar&aacute; ao usu&aacute;rio a possibilidade de escolher
	uma ou v&aacute;rias fun&ccedil;&otilde;es de agrega&ccedil;&atilde;o<FONT COLOR="#ff0000">
	</FONT>(m&eacute;dia, m&iacute;nimo, m&aacute;ximo, somat&oacute;rio)
	que se aplicar&atilde;o sobre os atributos num&eacute;ricos da
	camada destino/relacionada. 
	</P>
</UL>
<P><IMG SRC="spatialjoindesc.png" NAME="Imagen1" ALIGN=LEFT WIDTH=271 HEIGHT=285 BORDER=0><BR><BR>
</P>
</BODY>
</HTML>