<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
	<TITLE>Recortar</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.0  (Linux)">
	<META NAME="CREATED" CONTENT="20070803;10394100">
	<META NAME="CHANGED" CONTENT="20070803;10420900">
	<STYLE TYPE="text/css">
	<!--
		@page { size: 21cm 29.7cm }
	-->
	</STYLE>
</HEAD>
<BODY LANG="es-ES" DIR="LTR">
<P ALIGN=JUSTIFY STYLE="margin-top: 0.49cm; margin-bottom: 0.49cm"><SPAN LANG="ca-ES"><FONT COLOR="#800000"><B>Retallar</B>
</FONT></SPAN>
</P>
<P LANG="ca-ES" ALIGN=JUSTIFY STYLE="margin-top: 0.49cm; margin-bottom: 0.49cm">
Este geoproc&eacute;s permet limitar l'&agrave;mbit de treball d'una
capa vectorial (fa igual que siga de punts, l&iacute;nies o
pol&iacute;gons), i extrau d'esta una zona d'inter&eacute;s. 
</P>
<P LANG="ca-ES" ALIGN=JUSTIFY STYLE="margin-top: 0.49cm; margin-bottom: 0.49cm">
Per a aix&ograve;, l'usuari haur&agrave; de proporcionar una capa
d'entrada (la capa de qu&egrave; es vol extraure un zona) i una capa
de retall, de manera que la uni&oacute; de les geometries incloses en
la capa de retall definiran l'&agrave;mbit de treball. 
</P>
<P LANG="ca-ES" ALIGN=JUSTIFY STYLE="margin-top: 0.49cm; margin-bottom: 0.49cm">
El geoproc&eacute;s recorrer&agrave; tots els elements vectorials de
la capa d'entrada (funcions), i per a aquells que estiguen continguts
en l'&agrave;mbit de treball definit per la capa de retall, calcular&agrave;
les seues interseccions, de manera que en la capa resultat nom&eacute;s
estaran els elements vectorials del nostre &agrave;mbit d'inter&eacute;s.
La porci&oacute; de geometria que quede fora de l'&agrave;mbit de
treball ser&agrave; retallada.</P>
<P LANG="ca-ES" ALIGN=JUSTIFY STYLE="margin-top: 0.49cm; margin-bottom: 0.49cm">
L'esquema alfanum&egrave;ric de la capa d'entrada es mant&eacute;
intacte. 
</P>
<P LANG="ca-ES" ALIGN=JUSTIFY STYLE="margin-top: 0.49cm; margin-bottom: 0.49cm">
<IMG SRC="clipdesc.png" NAME="Imagen1" ALIGN=LEFT WIDTH=271 HEIGHT=285 BORDER=0>Este
geoproc&eacute;s pot ser de gran utilitat quan vulguem limitar el
nostre &agrave;mbit de treball a una zona concreta de detall, per&ograve;
tota la cartografia disponible &eacute;s de car&agrave;cter general.
Aix&iacute;, per exemple, a l'hora de muntar un GIS municipal,
permetria incloure cartografia de car&agrave;cter nacional o regional
limitant-la a l'&agrave;mbit d'inter&eacute;s del municipi. 
</P>
</BODY>
</HTML>