<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
	<TITLE>Recortar</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 2.0  (Linux)">
	<META NAME="CREATED" CONTENT="20070803;10424600">
	<META NAME="CHANGED" CONTENT="20070803;10450000">
	<STYLE TYPE="text/css">
	<!--
		@page { size: 21cm 29.7cm }
	-->
	</STYLE>
</HEAD>
<BODY LANG="es-ES" DIR="LTR">
<P ALIGN=JUSTIFY><FONT SIZE=2 STYLE="font-size: 9pt"><FONT COLOR="#800000"><B>RECORTAR</B>
/ <B>CLIP</B></FONT></FONT></P>
<P ALIGN=LEFT>Este geoprocesso permite limitar a regi&atilde;o ou
&aacute;rea de interesse de trabalho de uma camada vetorial (n&atilde;o
importando se s&atilde;o pontos, linhas ou pol&iacute;gonos),
extraindo desta uma zona de interesse. 
</P>
<P ALIGN=LEFT>Para isso, o usu&aacute;rio dever&aacute; proporcionar
uma camada de entrada (a camada a qual deseja-se extrair uma zona) e
uma camada de recorte, de forma que a uni&atilde;o das geometrias
inclu&iacute;das na camada de recorte definir&aacute; a regi&atilde;o
ou &aacute;rea de interesse de trabalho. 
</P>
<P ALIGN=JUSTIFY>O geoprocesso “varrer&aacute;” todos os
elementos vetoriais da camada de entrada (features), e para aqueles
que estejam contidos na mesma regi&atilde;o ou &aacute;rea de
interesse de trabalho definido pela camada de recorte, calcular&aacute;
suas interse&ccedil;&otilde;es, de forma que na camada resultante s&oacute;
estar&atilde;o os elementos vetoriais de nossa regi&atilde;o ou &aacute;rea
de interesse. A por&ccedil;&atilde;o de geometria que esteja fora da
&aacute;rea de interesse de trabalho ser&aacute; recortada. 
</P>
<P ALIGN=JUSTIFY>O esquema alfanum&eacute;rico da camada de entrada
se mant&eacute;m intacto. 
</P>
<UL>
	<P ALIGN=JUSTIFY><IMG SRC="clipdesc.png" NAME="Imagen1" ALIGN=LEFT WIDTH=271 HEIGHT=285 BORDER=0>Este
	geoprocesso pode ser de grande utilidade quando queremos limitar
	nossa regi&atilde;o de interesse de trabalho a uma zona espec&iacute;fica,
	mas toda a cartografia dispon&iacute;vel &eacute; de car&aacute;ter
	geral. Assim, por exemplo, no momento de montar um SIG Municipal,
	permitiria incluir cartografia de car&aacute;ter nacional ou
	regional limitando-a a regi&atilde;o ou &aacute;rea de interesse do
	munic&iacute;pio. 
	</P>
</UL>
</BODY>
</HTML>