#Translations for language [ru]
#Mon Sep 21 10:02:19 CEST 2009
a_panel=
abrir...=
aceptar=\u041e\u041a
Anadir_al_conjunto=\u0414\u043e\u0431\u0430\u0432\u0438\u0442\u044c \u043a \u043d\u0430\u0431\u043e\u0440\u0443
anterior=\u041f\u0440\u0435\u0434\u044b\u0434\u0443\u0449\u0438\u0439
aplicar=
ayuda=
ayuda_0=
ayuda_1_5=
ayuda_background=
ayuda_c=
ayuda_h=
ayuda_more_less=
ayuda_wheel=
bajar=
borrar_todos=\u0423\u0434\u0430\u043b\u0438\u0442\u044c \u0432\u0441\u0435
borrar_uno=\u0423\u0434\u0430\u043b\u0438\u0442\u044c \u0432\u044b\u0431\u0440\u0430\u043d\u043d\u044b\u0435 \u0442\u043e\u0447\u043a\u0438
calendarBackOneMonth=\u041d\u0430 \u043c\u0435\u0441\u044f\u0446 \u043d\u0430\u0437\u0430\u0434
calendarBackOneYear=\u041d\u0430 \u0433\u043e\u0434 \u043d\u0430\u0437\u0430\u0434
calendarForwardOneMonth=\u041d\u0430 \u043c\u0435\u0441\u044f\u0446 \u0432\u043f\u0435\u0440\u0435\u0434
calendarForwardOneYear=\u041d\u0430 \u0433\u043e\u0434 \u0432\u043f\u0435\u0440\u0435\u0434
calendarSelectDate=\u0412\u044b\u0431\u0440\u0430\u0442\u044c \u0434\u0430\u0442\u0443
calendarTitle=\u041a\u0430\u043b\u0435\u043d\u0434\u0430\u0440\u044c
cancel=\u041e\u0442\u043c\u0435\u043d\u0438\u0442\u044c
cancelar=\u041e\u0442\u043c\u0435\u043d\u0438\u0442\u044c
cannot_get_double_value_from_an_integer_number_field_use_getInteger()_instead=
cannot_set_a_double_value_from_an_integer_number_field_use_setInteger(int)_instead=
cerrar=\u0417\u0430\u043a\u0440\u044b\u0442\u044c
date_button_explanation=\u0420\u0430\u0437\u0440\u0435\u0448\u0430\u0435\u0442 \u0432\u044b\u0431\u043e\u0440 \u0434\u0430\u0442\u044b
de=\u0438\u0437
de\ 0=\u0438\u0437 0
deleteText=\u0423\u0434\u0430\u043b\u0438\u0442\u044c \u0442\u0435\u043a\u0441\u0442
deleteText_on_filter_use_explanation=\u0423\u0434\u0430\u043b\u0438\u0442\u044c \u0432\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435 \u0444\u0438\u043b\u044c\u0442\u0440\u0430
edit_copy=\u041a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u0442\u044c
edit_cut=\u0412\u044b\u0440\u0435\u0437\u0430\u0442\u044c
edit_delete=\u0423\u0434\u0430\u043b\u0438\u0442\u044c
edit_paste=\u0412\u0441\u0442\u0430\u0432\u0438\u0442\u044c
edit_redo=\u041f\u043e\u0432\u0442\u043e\u0440\u0438\u0442\u044c
edit_select_all=\u0412\u044b\u0431\u0440\u0430\u0442\u044c \u0432\u0441\u0435
edit_undo=\u041e\u0442\u043c\u0435\u043d\u0438\u0442\u044c
Error=
espere=\u041f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430, \u043f\u043e\u0434\u043e\u0436\u0434\u0438\u0442\u0435
Failed_pausing_the_process=
Failed_resuming_the_process=
Failed_the_process=
fields_uppercase_first=
filter_by_sentence=
filter_of_Table=
filtros=
guardar=\u0421\u043e\u0445\u0440\u0430\u043d\u0438\u0442\u044c
Information=
known_values=
msg_cancel_incrementable=
no=\u041d\u0435\u0442
No=
no_image_available=
nuevo=\u041d\u043e\u0432\u044b\u0439
Nuevo_conjunto=\u041d\u043e\u0432\u044b\u0439 \u043d\u0430\u0431\u043e\u0440
numero_incorrecto=\u041d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u043e\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435
ocultardetalles=
ok=\u041e\u041a
Open=
open_file=
operator_and_explanation=\u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 AND  (\u0414\u043b\u044f \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u0439 \u0441 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430\u043c\u0438 \u0432\u043e\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u041f\u0435\u0440\u0435\u0441\u0435\u0447\u0435\u043d\u0438\u0435 \u044d\u0442\u0438\u0445 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432; \u043a\u0430\u043a \u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440, \u0432\u043e\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0418\u0441\u0442\u0438\u043d\u0430, \u0435\u0441\u043b\u0438 \u043e\u0431\u0430 \u043e\u043f\u0435\u0440\u0430\u043d\u0434\u0430 \u0438\u043c\u0435\u044e\u0442 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0418\u0441\u0442\u0438\u043d\u0430)
operator_distinct_explanation=\u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 DISTINCT (\u0414\u043b\u044f \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u0439 \u0441 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430\u043c\u0438 \u0432\u043e\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u043f\u043e\u0434\u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u043e \u043d\u0435\u043f\u043e\u0432\u0442\u043e\u0440\u044f\u044e\u0449\u0438\u0445\u0441\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0439 \u044d\u0442\u0438\u0445 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432)
operator_equal_explanation=\u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 EQUAL (\u0414\u043b\u044f \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u0439 \u0441 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430\u043c\u0438 \u0432\u043e\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u043f\u043e\u0434\u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u043e \u043e\u0434\u0438\u043d\u0430\u043a\u043e\u0432\u044b\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0439 \u044d\u0442\u0438\u0445 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432)
operator_equal_greater_explanation=\u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 EQUAL OR GREATER (\u0412\u044b\u0431\u0438\u0440\u0430\u0435\u0442 \u0442\u0435 \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u044b \u043b\u0435\u0432\u043e\u0433\u043e \u043e\u043f\u0435\u0440\u0430\u043d\u0434\u0430 \u0438\u043b\u0438 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430, \u0434\u043b\u044f \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0431\u043e\u043b\u044c\u0448\u0435 \u0438\u043b\u0438 \u0440\u0430\u0432\u043d\u043e \u043f\u0440\u0430\u0432\u043e\u0433\u043e \u043e\u043f\u0435\u0440\u0430\u043d\u0434\u0430 \u0438\u043b\u0438 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430).
operator_equal_smaller_explanation=\u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 EQUAL OR SMALLER (\u0412\u044b\u0431\u0438\u0440\u0430\u0435\u0442 \u0442\u0435 \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u044b \u043b\u0435\u0432\u043e\u0433\u043e \u043e\u043f\u0435\u0440\u0430\u043d\u0434\u0430 \u0438\u043b\u0438 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430, \u0434\u043b\u044f \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043c\u0435\u043d\u044c\u0448\u0435 \u0438\u043b\u0438 \u0440\u0430\u0432\u043d\u043e \u043f\u0440\u0430\u0432\u043e\u0433\u043e \u043e\u043f\u0435\u0440\u0430\u043d\u0434\u0430 \u0438\u043b\u0438 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430).
operator_greater_explanation=\u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 GREATER (\u0412\u044b\u0431\u0438\u0440\u0430\u0435\u0442 \u0442\u0435 \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u044b \u043b\u0435\u0432\u043e\u0433\u043e \u043e\u043f\u0435\u0440\u0430\u043d\u0434\u0430 \u0438\u043b\u0438 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430, \u0434\u043b\u044f \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0431\u043e\u043b\u044c\u0448\u0435 \u043f\u0440\u0430\u0432\u043e\u0433\u043e \u043e\u043f\u0435\u0440\u0430\u043d\u0434\u0430 \u0438\u043b\u0438 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430).
operator_not_explanation=\u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 NOT (\u0414\u043b\u044f \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u0439 \u0441 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430\u043c\u0438 \u0432\u043e\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u0414\u043e\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u0435 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432; \u043a\u0430\u043a \u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440, \u0438\u0437\u043c\u0435\u043d\u044f\u0435\u0442 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0418\u0441\u0442\u0438\u043d\u0430 \u043d\u0430 \u041b\u043e\u0436\u044c \u0438\u043b\u0438 \u043d\u0430\u043e\u0431\u043e\u0440\u043e\u0442).
operator_or_explanation=\u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 OR (\u0414\u043b\u044f \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u0439 \u0441 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430\u043c\u0438 \u0432\u043e\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u041e\u0431\u044a\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u0435 \u044d\u0442\u0438\u0445 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432; \u043a\u0430\u043a \u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440, \u0432\u043e\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u041b\u043e\u0436\u044c, \u0435\u0441\u043b\u0438 \u043e\u0431\u0430 \u043e\u043f\u0435\u0440\u0430\u043d\u0434\u0430 \u0438\u043c\u0435\u044e\u0442 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u041b\u043e\u0436\u044c)
operator_smaller_explanation=\u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 SMALLER (\u0412\u044b\u0431\u0438\u0440\u0430\u0435\u0442 \u0442\u0435 \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u044b \u043b\u0435\u0432\u043e\u0433\u043e \u043e\u043f\u0435\u0440\u0430\u043d\u0434\u0430 \u0438\u043b\u0438 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430, \u0434\u043b\u044f \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043c\u0435\u043d\u044c\u0448\u0435 \u043f\u0440\u0430\u0432\u043e\u0433\u043e \u043e\u043f\u0435\u0440\u0430\u043d\u0434\u0430 \u0438\u043b\u0438 \u043c\u043d\u043e\u0436\u0435\u0441\u0442\u0432\u0430).
panel_adding_exception=
panel_loading_exception=
parenthesis_explanation=\u041a\u0440\u0443\u0433\u043b\u044b\u0435 \u0441\u043a\u043e\u0431\u043a\u0438 () (\u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044e\u0442\u0441\u044f \u0434\u043b\u044f \u0433\u0440\u0443\u043f\u043f\u0438\u0440\u043e\u0432\u043a\u0438 \u043e\u043f\u0435\u0440\u0430\u0446\u0438\u0439)
pausar=
Percent=
primero=\u041f\u0435\u0440\u0432\u044b\u0439
Process_canceled=
Process_failed=
Process_finished=
Process_finished_wont_be_cancelled=
reanudar=
registro=
salir=\u0412\u044b\u0445\u043e\u0434
seleccion_alpha=
Seleccionar_del_conjunto=\u0412\u044b\u0431\u0440\u0430\u0442\u044c \u0438\u0437 \u043d\u0430\u0431\u043e\u0440\u0430
select_color=
si=\u0434\u0430
siguiente=\u0421\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439
subir=
teclas=
text_preview_text=\u041f\u0440\u0435\u0434\u0432\u0430\u0440\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u0439 \u043f\u0440\u043e\u0441\u043c\u043e\u0442\u0440
the_panel=
The_process_cant_be_cancelled=
The_process_cant_be_paused=
tiempo_transcurrido=
title_cancel_incrementable=
ultimo=\u041f\u043e\u0441\u043b\u0435\u0434\u043d\u0438\u0439
validate_expression=
validate_filter_expression_explanation=
verdetalles=
Warning=
write_here_a_filter_expression=
Yes=
