#Translations for language [el]
#Mon Sep 21 10:02:19 CEST 2009
a_panel=
abrir...=
aceptar=\u0391\u03c0\u03bf\u03b4\u03bf\u03c7\u03ae
Anadir_al_conjunto=\u03a0\u03c1\u03bf\u03c3\u03b8\u03ae\u03ba\u03b7 \u03c3\u03c4\u03bf \u03c3\u03cd\u03bd\u03bf\u03bb\u03bf
anterior=\u03a0\u03c1\u03bf\u03b7\u03b3\u03bf\u03cd\u03bc\u03b5\u03bd\u03bf\u03c2
aplicar=
ayuda=
ayuda_0=
ayuda_1_5=
ayuda_background=
ayuda_c=
ayuda_h=
ayuda_more_less=
ayuda_wheel=
bajar=
borrar_todos=\u0394\u03b9\u03b1\u03b3\u03c1\u03b1\u03c6\u03ae \u03cc\u03bb\u03c9\u03bd
borrar_uno=\u0394\u03b9\u03b1\u03b3\u03c1\u03b1\u03c6\u03ae \u03b5\u03c0\u03b9\u03bb\u03b5\u03b3\u03bc\u03ad\u03bd\u03bf\u03c5 \u03c3\u03b7\u03bc\u03b5\u03af\u03bf\u03c5
calendarBackOneMonth=\u03a0\u03af\u03c3\u03c9 \u03ad\u03bd\u03b1 \u03bc\u03ae\u03bd\u03b1
calendarBackOneYear=\u03a0\u03af\u03c3\u03c9 \u03ad\u03bd\u03b1 \u03ad\u03c4\u03bf\u03c2
calendarForwardOneMonth=\u039c\u03c0\u03c1\u03bf\u03c3\u03c4\u03ac \u03ad\u03bd\u03b1 \u03bc\u03ae\u03bd\u03b1
calendarForwardOneYear=\u039c\u03c0\u03c1\u03bf\u03c3\u03c4\u03ac \u03ad\u03bd\u03b1 \u03ad\u03c4\u03bf\u03c2
calendarSelectDate=\u0395\u03c0\u03b9\u03bb\u03bf\u03b3\u03ae \u03b7\u03bc\u03b5\u03c1\u03bf\u03bc\u03b7\u03bd\u03af\u03b1\u03c2
calendarTitle=\u0397\u03bc\u03b5\u03c1\u03bf\u03bb\u03cc\u03b3\u03b9\u03bf
cancel=\u0391\u03ba\u03cd\u03c1\u03c9\u03c3\u03b7
cancelar=\u0391\u03ba\u03cd\u03c1\u03c9\u03c3\u03b7
cannot_get_double_value_from_an_integer_number_field_use_getInteger()_instead=
cannot_set_a_double_value_from_an_integer_number_field_use_setInteger(int)_instead=
cerrar=\u039a\u03bb\u03b5\u03af\u03c3\u03b9\u03bc\u03bf
date_button_explanation=\u0395\u03c0\u03b9\u03bb\u03bf\u03b3\u03ae \u03b7\u03bc\u03b5\u03c1\u03bf\u03bc\u03b7\u03bd\u03af\u03b1\u03c2
de=\u03c4\u03bf\u03c5
de\ 0=\u03c4\u03bf\u03c5 0
deleteText=\u0394\u03b9\u03b1\u03b3\u03c1\u03b1\u03c6\u03ae \u03ba\u03b5\u03b9\u03bc\u03ad\u03bd\u03bf\u03c5
deleteText_on_filter_use_explanation=\u0394\u03b9\u03b1\u03b3\u03c1\u03b1\u03c6\u03ae \u03c4\u03bf\u03c5 \u03b1\u03c0\u03bf\u03c4\u03b5\u03bb\u03ad\u03c3\u03bc\u03b1\u03c4\u03bf\u03c2 \u03c4\u03bf\u03c5 \u03c6\u03af\u03bb\u03c4\u03c1\u03bf\u03c5
edit_copy=\u0391\u03bd\u03c4\u03b9\u03b3\u03c1\u03b1\u03c6\u03ae
edit_cut=\u0391\u03c0\u03bf\u03ba\u03bf\u03c0\u03ae
edit_delete=\u0394\u03b9\u03b1\u03b3\u03c1\u03b1\u03c6\u03ae
edit_paste=\u0395\u03c0\u03b9\u03ba\u03cc\u03bb\u03bb\u03b7\u03c3\u03b7
edit_redo=\u0391\u03ba\u03cd\u03c1\u03c9\u03c3\u03b7 \u03b1\u03bd\u03b1\u03af\u03c1\u03b5\u03c3\u03b7\u03c2
edit_select_all=\u0395\u03c0\u03b9\u03bb\u03bf\u03b3\u03ae \u03cc\u03bb\u03c9\u03bd
edit_undo=\u0391\u03bd\u03b1\u03af\u03c1\u03b5\u03c3\u03b7
Error=
espere=\u03a0\u03b1\u03c1\u03b1\u03ba\u03b1\u03bb\u03ce \u03c0\u03b5\u03c1\u03b9\u03bc\u03ad\u03bd\u03b5\u03c4\u03b5
Failed_pausing_the_process=
Failed_resuming_the_process=
Failed_the_process=
fields_uppercase_first=
filter_by_sentence=
filter_of_Table=
filtros=
guardar=\u0391\u03c0\u03bf\u03b8\u03ae\u03ba\u03b5\u03c5\u03c3\u03b7
Information=
known_values=
msg_cancel_incrementable=
no=\u038c\u03c7\u03b9
No=
no_image_available=
nuevo=\u039d\u03ad\u03bf
Nuevo_conjunto=\u039d\u03ad\u03bf \u03c3\u03cd\u03bd\u03bf\u03bb\u03bf
numero_incorrecto=\u0386\u03ba\u03c5\u03c1\u03b7 \u03c4\u03b9\u03bc\u03ae
ocultardetalles=
ok=\u0391\u03c0\u03bf\u03b4\u03bf\u03c7\u03ae
Open=
open_file=
operator_and_explanation=\u03a4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2 \u039a\u0391\u0399 (\u0395\u03bd\u03b5\u03c1\u03b3\u03b5\u03af \u03c3\u03b1\u03bd \u03bc\u03b9\u03b1 \u0394\u03b9\u03b1\u03c4\u03bf\u03bc\u03ae \u03c3\u03c5\u03bd\u03cc\u03bb\u03c9\u03bd; \u03c9\u03c2 \u03bb\u03bf\u03b3\u03b9\u03ba\u03cc\u03c2 \u03c4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2, \u03b1\u03bb\u03b7\u03b8\u03b5\u03cd\u03b5\u03b9 \u03cc\u03c4\u03b1\u03bd \u03ba\u03b1\u03b9 \u03bf\u03b9 \u03b4\u03cd\u03bf \u03c3\u03c5\u03bd\u03c4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ad\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03b1\u03bb\u03b7\u03b8\u03b5\u03af\u03c2).
operator_distinct_explanation=\u03a4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2  \u0394\u0399\u0391\u03a6\u039f\u03a1\u039f \u0391\u03a0\u039f. (\u0395\u03c0\u03b9\u03bb\u03ad\u03b3\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c4\u03b1 \u03c3\u03c4\u03bf\u03b9\u03c7\u03b5\u03af\u03b1 \u03b5\u03ba\u03b5\u03af\u03bd\u03b1 \u03c0\u03bf\u03c5 \u03b4\u03b5\u03bd \u03c3\u03c5\u03bc\u03c0\u03af\u03c0\u03c4\u03bf\u03c5\u03bd \u03bc\u03b5\u03c4\u03b1\u03be\u03cd \u03ba\u03b1\u03b9 \u03c4\u03c9\u03bd \u03b4\u03cd\u03bf \u03c3\u03c5\u03bd\u03cc\u03bb\u03c9\u03bd).
operator_equal_explanation=\u03a4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2 \u0399\u03a3\u039f\u03a3. (\u0395\u03c0\u03b9\u03bb\u03ad\u03b3\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c4\u03b1 \u03c3\u03c4\u03bf\u03b9\u03c7\u03b5\u03af\u03b1 \u03b5\u03ba\u03b5\u03af\u03bd\u03b1 \u03c0\u03bf\u03c5 \u03c3\u03c5\u03bc\u03c0\u03af\u03c0\u03c4\u03bf\u03c5\u03bd \u03bc\u03b5\u03c4\u03b1\u03be\u03cd \u03ba\u03b1\u03b9 \u03c4\u03c9\u03bd \u03b4\u03cd\u03bf \u03c3\u03c5\u03bd\u03cc\u03bb\u03c9\u03bd).
operator_equal_greater_explanation=\u03a4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2 \u039c\u0395\u0393\u0391\u039b\u03a5\u03a4\u0395\u03a1\u039f \u0389 \u0399\u03a3\u039f. (\u0395\u03c0\u03b9\u03bb\u03ad\u03b3\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c4\u03b1 \u03c3\u03c4\u03bf\u03b9\u03c7\u03b5\u03af\u03b1 \u03b5\u03ba\u03b5\u03af\u03bd\u03b1 \u03c4\u03bf\u03c5 \u03c4\u03b5\u03bb\u03bf\u03cd\u03bd\u03c4\u03b1\u03b9/\u03c3\u03c5\u03bd\u03b4\u03c5\u03ac\u03b6\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c3\u03c4\u03b1 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03c4\u03bf\u03c5 \u03c4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae \u03ba\u03b1\u03b9 \u03c0\u03bf\u03c5 \u03ad\u03c7\u03bf\u03c5\u03bd \u03bc\u03b5\u03b3\u03b1\u03bb\u03cd\u03c4\u03b5\u03c1\u03b7 \u03b1\u03c0\u03cc \u03ae \u03af\u03c3\u03b7 \u03c4\u03b9\u03bc\u03ae \u03bc\u03b5 \u03b1\u03c5\u03c4\u03ac \u03c3\u03c4\u03b1 \u03b4\u03b5\u03be\u03b9\u03ac \u03c4\u03bf\u03c5).
operator_equal_smaller_explanation=\u03a4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2 \u039c\u0399\u039a\u03a1\u039f\u03a4\u0395\u03a1\u039f \u0397\u0384\u0399\u03a3\u039f. (\u0395\u03c0\u03b9\u03bb\u03ad\u03b3\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c4\u03b1 \u03c3\u03c4\u03bf\u03b9\u03c7\u03b5\u03af\u03b1 \u03b5\u03ba\u03b5\u03af\u03bd\u03b1 \u03c0\u03bf\u03c5 \u03c4\u03b5\u03bb\u03bf\u03cd\u03bd\u03c4\u03b1\u03b9/\u03c3\u03c5\u03bd\u03b4\u03c5\u03ac\u03b6\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c3\u03c4\u03b1 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03c4\u03bf\u03c5 \u03c4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae \u03ba\u03b1\u03b9 \u03c0\u03bf\u03c5 \u03ad\u03c7\u03bf\u03c5\u03bd \u03bc\u03b9\u03ba\u03c1\u03cc\u03c4\u03b5\u03c1\u03b7 \u03b1\u03c0\u03cc \u03ae \u03af\u03c3\u03b7 \u03c4\u03b9\u03bc\u03ae \u03bc\u03b5 \u03b1\u03c5\u03c4\u03ac \u03c3\u03c4\u03b1 \u03b4\u03b5\u03be\u03b9\u03ac \u03c4\u03bf\u03c5).
operator_greater_explanation=\u03a4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2 \u039c\u0395\u0393\u0391\u039b\u03a5\u03a4\u0395\u03a1\u039f\u03a3 \u0391\u03a0\u039f. (\u0395\u03c0\u03b9\u03bb\u03ad\u03b3\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c4\u03b1 \u03c3\u03c4\u03bf\u03b9\u03c7\u03b5\u03af\u03b1 \u03b5\u03ba\u03b5\u03af\u03bd\u03b1 \u03c0\u03bf\u03c5 \u03c4\u03b5\u03bb\u03bf\u03cd\u03bd\u03c4\u03b1\u03b9/\u03c3\u03c5\u03bd\u03b4\u03c5\u03ac\u03b6\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c3\u03c4\u03b1 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03c4\u03bf\u03c5 \u03c4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae \u03ba\u03b1\u03b9 \u03c0\u03bf\u03c5 \u03ad\u03c7\u03bf\u03c5\u03bd \u03bc\u03b5\u03b3\u03b1\u03bb\u03cd\u03c4\u03b5\u03c1\u03b7 \u03c4\u03b9\u03bc\u03ae \u03b1\u03c0\u03cc \u03b1\u03c5\u03c4\u03ac \u03c3\u03c4\u03b1 \u03b4\u03b5\u03be\u03b9\u03ac \u03c4\u03bf\u03c5).
operator_not_explanation=\u03a4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2 \u039f\u03a7\u0399 (\u039b\u03b5\u03b9\u03c4\u03bf\u03c5\u03c1\u03b3\u03b5\u03af \u03c9\u03c2 \u03bf \u03c3\u03c5\u03bc\u03c0\u03bb\u03b7\u03c1\u03c9\u03bc\u03b1\u03c4\u03b9\u03ba\u03cc\u03c2 \u03c3\u03b5 \u03c3\u03cd\u03bd\u03bf\u03bb\u03b1;  \u03c9\u03c2 \u03bb\u03bf\u03b3\u03b9\u03ba\u03cc\u03c2 \u03c4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2, \u03b1\u03bb\u03bb\u03ac\u03b6\u03b5\u03b9 \u03c3\u03b5 \u03b1\u03bb\u03b7\u03b8\u03ae\u03c2 \u03b3\u03b9\u03b1 \u03c4\u03bf\u03bd \u03c8\u03b5\u03c5\u03b4\u03ae \u03ae \u03b1\u03bd\u03c4\u03af\u03c3\u03c4\u03c1\u03bf\u03c6\u03b1).
operator_or_explanation=\u03a4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2 \u0389 (\u039b\u03b5\u03b9\u03c4\u03bf\u03c5\u03c1\u03b3\u03b5\u03af \u03c9\u03c2 \u03ad\u03bd\u03c9\u03c3\u03b7 \u03c3\u03b5 \u03c3\u03cd\u03bd\u03bf\u03bb\u03b1; \u03c9\u03c2 \u03bb\u03bf\u03b3\u03b9\u03ba\u03cc\u03c2 \u03c4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2, \u03b4\u03af\u03bd\u03b5\u03b9 \u03c8\u03b5\u03c5\u03b4\u03ad\u03c2 \u03b1\u03bd \u03ba\u03b1\u03b9 \u03bf\u03b9 \u03b4\u03cd\u03bf \u03c3\u03c5\u03bd\u03c4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ad\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c8\u03b5\u03c5\u03b4\u03b5\u03af\u03c2).
operator_smaller_explanation=\u03a4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae\u03c2 \u039c\u0399\u039a\u03a1\u039f\u03a4\u0395\u03a1\u039f\u03a3 \u0391\u03a0\u039f. (\u0395\u03c0\u03b9\u03bb\u03ad\u03b3\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c4\u03b1 \u03c3\u03c4\u03bf\u03b9\u03c7\u03b5\u03af\u03b1 \u03b5\u03ba\u03b5\u03af\u03bd\u03b1 \u03c0\u03bf\u03c5 \u03c4\u03b5\u03bb\u03bf\u03cd\u03bd\u03c4\u03b1\u03b9/\u03c3\u03c5\u03bd\u03b4\u03c5\u03ac\u03b6\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c3\u03c4\u03b1 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03c4\u03bf\u03c5 \u03c4\u03b5\u03bb\u03b5\u03c3\u03c4\u03ae \u03ba\u03b1\u03b9 \u03c0\u03bf\u03c5 \u03ad\u03c7\u03bf\u03c5\u03bd \u03bc\u03b9\u03ba\u03c1\u03cc\u03c4\u03b5\u03c1\u03b7 \u03c4\u03b9\u03bc\u03ae \u03b1\u03c0\u03cc \u03b1\u03c5\u03c4\u03ac \u03c3\u03c4\u03b1 \u03b4\u03b5\u03be\u03b9\u03ac \u03c4\u03bf\u03c5).
panel_adding_exception=
panel_loading_exception=
parenthesis_explanation=\u0395\u03b9\u03c3\u03b1\u03b3\u03c9\u03b3\u03ae \u03c0\u03b1\u03c1\u03b5\u03bd\u03b8\u03ad\u03c3\u03b5\u03c9\u03bd () (\u03a7\u03c1\u03ae\u03c3\u03b9\u03bc\u03bf \u03c3\u03c4\u03b7\u03bd \u03bf\u03bc\u03b1\u03b4\u03bf\u03c0\u03bf\u03af\u03b7\u03c3\u03b7 \u03bb\u03b5\u03b9\u03c4\u03bf\u03c5\u03c1\u03b3\u03b9\u03ce\u03bd).
pausar=
Percent=
primero=\u03a0\u03c1\u03ce\u03c4\u03bf\u03c2
Process_canceled=
Process_failed=
Process_finished=
Process_finished_wont_be_cancelled=
reanudar=
registro=
salir=\u0388\u03be\u03bf\u03b4\u03bf\u03c2
seleccion_alpha=
Seleccionar_del_conjunto=\u0395\u03c0\u03b9\u03bb\u03bf\u03b3\u03ae \u03b1\u03c0\u03cc \u03c3\u03cd\u03bd\u03bf\u03bb\u03bf
select_color=
si=\u03bd\u03b1\u03b9
siguiente=\u0395\u03c0\u03cc\u03bc\u03b5\u03bd\u03bf
subir=
teclas=
text_preview_text=\u03a0\u03c1\u03bf\u03b5\u03c0\u03b9\u03c3\u03ba\u03cc\u03c0\u03b7\u03c3\u03b7
the_panel=
The_process_cant_be_cancelled=
The_process_cant_be_paused=
tiempo_transcurrido=
title_cancel_incrementable=
ultimo=\u03a4\u03b5\u03bb\u03b5\u03c5\u03c4\u03b1\u03af\u03bf\u03c2
validate_expression=
validate_filter_expression_explanation=
verdetalles=
Warning=
write_here_a_filter_expression=
Yes=
